
## Plan Result

[CI link](https://github.com/hayas1/tfgh/actions/runs/11879281063)


<pre><code>Plan: 14 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.repositories[&#34;relentless&#34;].github_issue_label.this[&#34;breaking&#34;]
  * module.repositories[&#34;relentless&#34;].github_issue_label.this[&#34;bugfix&#34;]
  * module.repositories[&#34;relentless&#34;].github_issue_label.this[&#34;deps&#34;]
  * module.repositories[&#34;relentless&#34;].github_issue_label.this[&#34;documentation&#34;]
  * module.repositories[&#34;relentless&#34;].github_issue_label.this[&#34;feature&#34;]
  * module.repositories[&#34;relentless&#34;].github_issue_label.this[&#34;maintenance&#34;]
  * module.repositories[&#34;relentless&#34;].github_issue_label.this[&#34;refactor&#34;]
  * module.repositories[&#34;relentless&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;relentless&#34;].github_repository_file.this[&#34;github/labeler.yml&#34;]
  * module.repositories[&#34;relentless&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;relentless&#34;].github_repository_file.this[&#34;github/release.yml&#34;]
  * module.repositories[&#34;relentless&#34;].github_repository_file.this[&#34;github/workflows/labeler.yml&#34;]
  * module.repositories[&#34;relentless&#34;].github_repository_pull_request.managed
  * module.repositories[&#34;relentless&#34;].github_repository_ruleset.this
* Update
  * module.repositories[&#34;relentless&#34;].github_repository.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.repositories["relentless"].github_issue_label.this["breaking"] will be created
  + resource "github_issue_label" "this" {
      + color       = "F84AD4"
      + description = "Containing breaking changes"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "breaking"
      + repository  = "relentless"
      + url         = (known after apply)
    }

  # module.repositories["relentless"].github_issue_label.this["bugfix"] will be created
  + resource "github_issue_label" "this" {
      + color       = "DE3659"
      + description = "Fix some bugs"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "bugfix"
      + repository  = "relentless"
      + url         = (known after apply)
    }

  # module.repositories["relentless"].github_issue_label.this["deps"] will be created
  + resource "github_issue_label" "this" {
      + color       = "36BF46"
      + description = "Dependency updates"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "deps"
      + repository  = "relentless"
      + url         = (known after apply)
    }

  # module.repositories["relentless"].github_issue_label.this["documentation"] will be created
  + resource "github_issue_label" "this" {
      + color       = "0075CA"
      + description = "Documentation"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "documentation"
      + repository  = "relentless"
      + url         = (known after apply)
    }

  # module.repositories["relentless"].github_issue_label.this["feature"] will be created
  + resource "github_issue_label" "this" {
      + color       = "008B75"
      + description = "New feature"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "feature"
      + repository  = "relentless"
      + url         = (known after apply)
    }

  # module.repositories["relentless"].github_issue_label.this["maintenance"] will be created
  + resource "github_issue_label" "this" {
      + color       = "7F6054"
      + description = "No effect on codebase"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "maintenance"
      + repository  = "relentless"
      + url         = (known after apply)
    }

  # module.repositories["relentless"].github_issue_label.this["refactor"] will be created
  + resource "github_issue_label" "this" {
      + color       = "BA5798"
      + description = "Refactoring"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "refactor"
      + repository  = "relentless"
      + url         = (known after apply)
    }

  # module.repositories["relentless"].github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ auto_init                   = false -> true
      - has_downloads               = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "relentless"
        name                        = "relentless"
        # (32 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["relentless"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Expectation :butterfly:
            > [Delete me] What behavior is expected?
            
            ## Reality :bug:
            > [Delete me] How does it actually work?
            
            ## Environment :evergreen_tree:
            > [Delete me] (When and) Where the behavior was observed?
            
            ## Cause :mag:
            > [Delete me] Why this issue was occurred?
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                            = ".github/issue_template.md"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "relentless"
      + sha                             = (known after apply)
    }

  # module.repositories["relentless"].github_repository_file.this["github/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/labeler.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
      + file                            = ".github/labeler.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "relentless"
      + sha                             = (known after apply)
    }

  # module.repositories["relentless"].github_repository_file.this["github/pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/pull_request_template.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Overview :rocket:
            > [Delete me] What is this pull request?
            
            ## Implementation :clamp:
            > [Delete me] How to realize ?
            
            ## Use cases :chopsticks:
            > [Delete me] Why this pull request was created?
            
            ## Testing :gear:
            > [Delete me] Testing steps
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                            = ".github/pull_request_template.md"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "relentless"
      + sha                             = (known after apply)
    }

  # module.repositories["relentless"].github_repository_file.this["github/release.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/release.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
      + file                            = ".github/release.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "relentless"
      + sha                             = (known after apply)
    }

  # module.repositories["relentless"].github_repository_file.this["github/workflows/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/workflows/labeler.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
      + file                            = ".github/workflows/labeler.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "relentless"
      + sha                             = (known after apply)
    }

  # module.repositories["relentless"].github_repository_pull_request.managed will be created
  + resource "github_repository_pull_request" "managed" {
      + base_ref              = "master"
      + base_repository       = "relentless"
      + base_sha              = (known after apply)
      + body                  = <<-EOT
            - .github/issue_template.md
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
      + draft                 = (known after apply)
      + head_ref              = "chore/managed-by-terraform"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "[auto] snippet files managed by Terraform"
      + updated_at            = (known after apply)
    }

  # module.repositories["relentless"].github_repository_ruleset.this will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "default"
      + node_id     = (known after apply)
      + repository  = "relentless"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + non_fast_forward              = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }
        }
    }

Plan: 14 to add, 1 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"7ae6480d192739ca4c1575ce23db50620bad48f593c69cbc3f69768a0ef57bb2\"" -> "W/\"2f630bb29506ca966e6b6dbfaa938496bcc63d3521b9af9294e1bca806c1969e\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"4743623b287c36600e0e8514ca5b803c23be07870b828abe61ff7e0ed88787cc\"" -> "W/\"f4b772ed540526158bea630cb8caec572c3c3e3f4c097c4e983132bbb15b2ebb\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["json-with-comments"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"84c4677f03eba2b27fd8368499b97c929f32a83dccd343f5967f642238230ce0\"" -> "W/\"50cb1fbb96f70cd1899a472a513381e65f06f82ccf9e7b955a79e8228f135cf5\""
        id                          = "json-with-comments"
        name                        = "json-with-comments"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["relentless"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"dd821f9b3f2b3fde7f2422bc6fa75ed6e268207530c77d7c2db5f408ad2c1b6f\"" -> "W/\"2b5759d56969144b2d683f37b43667d1fcb95d1726464ea1ab0ee65858047ec2\""
        id                          = "relentless"
        name                        = "relentless"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"4d5d0ec2ec9fbd78cb2fc89d16d2fd5d28bb559e563420f4cca8c57003300c5b\"" -> "W/\"53d4b038399440507c2c1bd6583b3199099da6e37ef2e47afafcce729cc92b19\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["tokei-toukei"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"fd0b583862fcd9cbe0144c8d58d4f688f34091577b75041df288e587af16b9dc\"" -> "W/\"16cd1a2f0e9c4adcb1b883b4a9a69e1289ab7ee6b094c50be8d5453bcd264326\""
        id                          = "tokei-toukei"
        name                        = "tokei-toukei"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":76,"Program":"tfcmt","SHA1":"dcea4c94ca1ab79479195a68e9c7add1d9ecd1d3","Vars":{},"WorkflowName":"Terraform plan on pull request"} -->